{
  "Math.randomBoolean":"Genera un valor 'verdadero' o 'false' al azar, al igual que una moneda de los bancos.",
  "String.fromCharCode":"Hacer una cadena desde el código de carácter ASCII dado.",
  "basic":"Proporciona acceso a funcionalidad básica micro: bit.",
  "basic.clearScreen":"Apagar todos los LEDs",
  "basic.forever":"Repite el código para siempre en el fondo. En cada iteración, permite otros códigos ejecutar.",
  "basic.pause":"Pausa para el tiempo especificado en milisegundos",
  "basic.plotLeds":"Dibuja una imagen en la pantalla de LED.",
  "basic.showAnimation":"Muestra una secuencia de pantallas de LED como una animación.",
  "basic.showLeds":"Dibuja una imagen en la pantalla de LED.",
  "basic.showNumber":"Desplácese a un número en la pantalla. Si el número cabe en la pantalla (es decir, es un solo dígito), no se desplazan.",
  "basic.showString":"Mostrar texto en la pantalla, un carácter a la vez. Si la cadena encaja en la pantalla (es decir, es una letra), no se desplacen.",
  "control":"Utilidades de tiempo de ejecución y evento.",
  "control.inBackground":"Horarios de código que se ejecutan en segundo plano.",
  "control.reset":"Restablece el BBC micro: bit.",
  "game":"Un motor de juego de sprite solo LED",
  "game.addScore":"Añade puntos a la cuenta corriente",
  "game.gameOver":"Muestra un juego más de animación.",
  "game.score":"Obtiene la puntuación actual",
  "game.setScore":"Establece el valor de cuenta actual",
  "game.startCountdown":"Comienza un temporizador de cuenta atrás juego",
  "images":"Creación, manipulación y visualización de imágenes LED.",
  "images.createBigImage":"Crea una imagen con 2 marcos.",
  "images.createImage":"Crea una imagen que encaja en la pantalla de LED.",
  "input":"Eventos y datos de los sensores",
  "input.acceleration":"Obtener el valor de la aceleración en milli-gravitys (cuando es poner la junta plana con la pantalla hacia arriba, x = 0, y = 0 y z =-1024)",
  "input.buttonIsPressed":"Obtener el estado de botón (presionado o no) para '' A'' y '' B''.",
  "input.calibrate":"Obsoleto, brújula calibración es automática.",
  "input.compassHeading":"Consigue el actual rumbo de la brújula brújula en grados.",
  "input.lightLevel":"Lee el nivel de luz aplicado a la pantalla de LED en un rango de '' 0'' (oscuro) a '' 255'' brillante.",
  "input.magneticForce":"Obtener el valor de la fuerza magnética en '' micro Teslas'' ('' μT ''). Esta función no se admite en el simulador.",
  "input.onButtonPressed":"Hacer algo cuando se pulsa un botón ('' A'', '' B'' o ambos '' A + B'')",
  "input.onGesture":"Concede el código a ejecutar cuando la pantalla quede mirando hacia arriba.",
  "input.onLogoDown":"Concede el código a ejecutar cuando el logo está orientado hacia abajo y el tablero es vertical.",
  "input.onLogoUp":"Concede el código a ejecutar cuando el logo está orientado hacia arriba y el tablero es vertical.",
  "input.onPinPressed":"Hacer algo cuando se pulsa un pin ('' P0'', '' P1'' o '' ambos P2'').",
  "input.onScreenDown":"Concede el código a ejecutar cuando la pantalla esté hacia abajo.",
  "input.onScreenUp":"Concede el código a ejecutar cuando la pantalla quede mirando hacia arriba.",
  "input.onShake":"Concede el código a ejecutar cuando se agita el dispositivo.",
  "input.pinIsPressed":"Obtener el estado de pin (presionado o no). Requiere para mantener el suelo para cerrar el circuito.",
  "input.rotation":"El tono del dispositivo de rotación a lo largo del '' x '', en grados.",
  "input.runningTime":"Obtiene. que el número de milisegundos transcurrido desde el poder.",
  "input.setAccelerometerRange":"Establece el intervalo de muestra de acelerómetro en gravedades.",
  "input.temperature":"Obtiene la temperatura en grados Celsius grados (° C).",
  "led":"Control de la pantalla LED.",
  "led.brightness":"Bajar el brillo de la pantalla de 0 () a 255 (completo brillante).",
  "led.fadeIn":"Difumina en la pantalla.",
  "led.fadeOut":"Se descolora hacia fuera el brillo de la pantalla.",
  "led.plot":"Encienda el LED especificado usando, coordenadas x y (x es horizontal, es vertical). (0,0) es la parte superior izquierda.",
  "led.plotAll":"Enciende todos los LEDS",
  "led.plotBarGraph":"Muestra un gráfico de barras vertical basado en el 'valor' y ' valor '.\nSi 'alto' es 0, la carta es ajustada automáticamente.",
  "led.point":"Obtener el estado de encendido de la especificada usando LED, coordenadas x y. (0,0) es la parte superior izquierda.",
  "led.screenshot":"Toma una captura de pantalla de la pantalla LED y devuelve una imagen.",
  "led.setBrightness":"Configurar el brillo de la pantalla de 0 (off) a 255 (completo brillante).",
  "led.setDisplayMode":"Establece el modo de pantalla entre el blanco y negro y escala de grises para la representación de LEDs.",
  "led.stopAnimation":"Cancela la animación actual y borra otros pendiente de animaciones.",
  "led.toggle":"Alterna un píxel particular",
  "led.toggleAll":"Invierte la actual pantalla de LED",
  "led.unplot":"Apagar el LED especificado usando, coordenadas x y (x es horizontal, es vertical). (0,0) es la parte superior izquierda.",
  "music":"Generación de tonos de la música a través de pin '' P0''.",
  "music.beat":"Devuelve la duración de un beat en milisegundos",
  "music.changeTempoBy":"Cambiar el tempo en la cantidad especificada",
  "music.noteFrequency":"Obtiene la frecuencia de una nota.",
  "music.playTone":"Se reproduce un tono a través de pin '' P0'' la duración determinada.",
  "music.rest":"Descansa (juega nada) durante un tiempo especificado a través de pin '' P0''.",
  "music.ringTone":"Toca un tono a través de pin '' P0''.",
  "music.setTempo":"El ritmo se establece en la cantidad especificada",
  "music.tempo":"Vuelve el ritmo en pulsaciones por minuto. Tempo es la velocidad (bpm = beats por minuto) en qué juego de notas. Cuanto mayor sea el valor del tempo, se juegan más rápido las notas.",
  "pins":"Control de corrientes de Pins para señales de analógico\/digital, servos, i2c...",
  "pins.analogPitch":"Emite una señal de ancho de pulso modulación (PWM) para el pin de la echada actual. Utilice 'analog set pin pitch' para definir el pin pitch.",
  "pins.analogReadPin":"Lea el valor de conector como analógica, es decir, como un valor comprendido entre 0 y 1023.",
  "pins.analogSetPeriod":"Configura la modulación por ancho de pulso (PWM) de la analógica de salida para el valor dado en ** microsegundos ** o ' 1\/1000 «milisegundos.\nSi este pin no está configurado como un análogo de salida (usando 'escritura analógica pin'), la operación no tiene efecto.",
  "pins.analogSetPitchPin":"Establece el pin cuando se usa 'pins-> tono analógico'.",
  "pins.analogWritePin":"Establezca el valor de conector como analógica. Debe estar conformados por valor de entre 0 y 1023.",
  "pins.digitalReadPin":"Leer el pin especificado o conector como 0 o 1",
  "pins.digitalWritePin":"Establecer un valor de pin o conector de 0 o 1.",
  "pins.i2cReadNumber":"Leer un número de 7 bits I2C dirección.",
  "pins.i2cWriteNumber":"Escribir un número en una dirección de 7 bits I2C.",
  "pins.map":"Volver a le asigna un número del uno al otro. Es decir, un valor de '' de baja '' conseguir asignado a '' a la baja '', un valor de '' de alta '' a '' a '', valores intermedios a intermedios, etc. de valores.",
  "pins.onPulsed":"Configura este pin a una entrada digital y genera eventos donde la marca de tiempo es la duración que este pin fue '' alto '' o '' baja ''.",
  "pins.pulseDuration":"Obtiene la duración del último pulso en micro segundos. Esta función debe ser llamada desde un controlador de '' onPulsed''.",
  "pins.servoSetPulse":"Configura este pin IO como salida analógica\/pwm, configura el período para ser ms 20 y establece el ancho de pulso, basado en el valor se da ** microsegundos ** o ' 1\/1000 «milisegundos.",
  "pins.servoWritePin":"Escribe un valor en el servo, control del eje por consiguiente. En un servo estándar, esto ajustará el ángulo del eje (en grados), moviendo el eje para que la orientación. En un servo de rotación continua, esto ajustará la velocidad del servo (siendo '' 0'' máxima velocidad en una dirección, '' 180'' lleno de velocidad en el otro y un valor de cerca de '' 90'' no que ningún movimiento).",
  "pins.setPull":"Configura el tirón de este pin.",
  "serial":"Leer y escribir datos en una conexión en serie.",
  "serial.readLine":"Lee una línea de texto del puerto serial.",
  "serial.redirect":"Configurar dinámicamente la instancia serial para usar pernos excepto USBTX y USBRX.",
  "serial.writeLine":"Imprime una línea de texto para la serie",
  "serial.writeNumber":"Imprime un valor numérico a la serie",
  "serial.writeString":"Envía un fragmento de texto a través de la conexión en serie.",
  "serial.writeValue":"Escribe un \"nombre: valor '' par línea de la serie."
}