{
  "radio": "Communicate data using radio packets",
  "radio.onDataPacketReceived": "Registers code to run when the radio receives a packet. Also takes the\nreceived packet from the radio queue.",
  "radio.onDataReceived": "Registers code to run when a packet is received over radio.",
  "radio.receiveNumber": "Reads the next packet from the radio queue and returns the packet's number\npayload or 0 if the packet did not contain a number.",
  "radio.receiveString": "Reads the next packet from the radio queue and returns the packet's string\npayload or the empty string if the packet did not contain a string.",
  "radio.receivedNumber": "Returns the number payload from the last packet taken from the radio queue\n(via ``receiveNumber``, ``receiveString``, etc) or 0 if that packet did not\ncontain a number.",
  "radio.receivedSerial": "Returns the serial number of the sender micro:bit from the last packet taken\nfrom the radio queue (via ``receiveNumber``, ``receiveString``, etc) or 0 if\nthat packet did not send a serial number.",
  "radio.receivedSignalStrength": "Gets the received signal strength indicator (RSSI) from the last packet taken\nfrom the radio queue (via ``receiveNumber``, ``receiveString``, etc). Not supported in simulator.\nnamespace=radio",
  "radio.receivedString": "Returns the string payload from the last packet taken from the radio queue\n(via ``receiveNumber``, ``receiveString``, etc) or the empty string if that\npacket did not contain a string.",
  "radio.receivedTime": "Returns the system time of the sender micro:bit at the moment when it sent the\nlast packet taken from the radio queue (via ``receiveNumber``,\n``receiveString``, etc).",
  "radio.sendNumber": "Broadcasts a number over radio to any connected micro:bit in the group.",
  "radio.sendString": "Broadcasts a string along with the device serial number\nand running time to any connected micro:bit in the group.",
  "radio.sendValue": "Broadcasts a name / value pair along with the device serial number\nand running time to any connected micro:bit in the group.",
  "radio.sendValue|param|name": "the field name (max 12 characters), eg: \"name\"",
  "radio.sendValue|param|value": "the numberic value",
  "radio.setGroup": "Sets the group id for radio communications. A micro:bit can only listen to one group ID at any time.",
  "radio.setGroup|param|id": "the group id between ``0`` and ``255``, eg: 1",
  "radio.setTransmitPower": "Change the output power level of the transmitter to the given value.",
  "radio.setTransmitPower|param|power": "a value in the range 0..7, where 0 is the lowest power and 7 is the highest. eg: 7",
  "radio.setTransmitSerialNumber": "Set the radio to transmit the serial number in each message.",
  "radio.setTransmitSerialNumber|param|transmit": "value indicating if the serial number is transmitted, eg: true",
  "radio.writeReceivedPacketToSerial": "Writes the last received packet to serial as JSON. This should be called\nwithin an ``onDataPacketReceived`` callback.",
  "radio.writeValueToSerial": "Reads the next packet from the radio queue and and writes it to serial\nas JSON."
}