{
  "Math.randomBoolean":"Erzeugt einen \"echten\" oder \"falschen\" Wert zufällig, wie eine Münze werfen.",
  "String.fromCharCode":"Machen Sie eine Zeichenfolge aus den angegebenen ASCII-Zeichencode.",
  "basic":"Bietet Zugriff auf grundlegende Mikro: Bit-Funktionalität.",
  "basic.clearScreen":"Schalten Sie alle LEDs",
  "basic.forever":"Den Code für immer im Hintergrund wiederholt. Bei jeder Iteration können andere Codes ausgeführt.",
  "basic.pause":"Pause für die angegebene Zeit in Millisekunden",
  "basic.plotLeds":"Zeichnet ein Bild auf dem LED-Bildschirm.",
  "basic.showAnimation":"Zeigt eine Folge von LED-Screens als Animation.",
  "basic.showLeds":"Zeichnet ein Bild auf dem LED-Bildschirm.",
  "basic.showNumber":"Blättern Sie eine Zahl auf dem Bildschirm. Wenn die Zahl auf dem Bildschirm passt (d. h. eine einzelne Ziffer), nicht scrollen.",
  "basic.showString":"Text auf dem Display, ein Zeichen zu einem Zeitpunkt anzeigen. Wenn die Zeichenfolge auf dem Bildschirm passt (d. h. einen Buchstaben), wird kein Bildlauf.",
  "control":"Laufzeit und Ereignis-Dienstprogramme.",
  "control.inBackground":"Zeitpläne codieren, die im Hintergrund laufen.",
  "control.reset":"Das BBC-Mikro: Bit setzt.",
  "game":"Eine Einzel-LED-Sprite-game-engine",
  "game.addScore":"Den aktuellen Punktestand hinzugefügt Punkte",
  "game.gameOver":"Zeigt ein Spiel über Animation.",
  "game.score":"Ruft den aktuellen Punktestand",
  "game.setScore":"Legt den aktuellen Wert der Partitur",
  "game.startCountdown":"Startet einen Spiel Countdowntimer",
  "images":"Erstellung, Bearbeitung und Anzeige LED-Bilder.",
  "images.createBigImage":"Erzeugt ein Bild mit 2 Bildern.",
  "images.createImage":"Erstellt ein Bild, das passt auf dem LED-Bildschirm.",
  "input":"Ereignisse und Daten von Sensoren",
  "input.acceleration":"Der Beschleunigungswert in Milli-Gravitys zu bekommen (wenn das Board legt flach mit dem Bildschirm auf, X = 0, y = 0 und Z =-1024)",
  "input.buttonIsPressed":"Erhalten Sie den Zustand der Schaltfläche (gepresst oder nicht) für '' ein '' und '' B''.",
  "input.calibrate":"Veraltet, Kompass Kalibrierung erfolgt automatisch.",
  "input.compassHeading":"Erhalten Sie die aktuellen Kompass-Kompass-Kurs in Grad.",
  "input.lightLevel":"Liest die Lichtintensität auf dem LED-Bildschirm in einem Bereich von '' 0'' (dunkel) bis cm 255 cm hell angewendet.",
  "input.magneticForce":"Rufen Sie den Magnetkraft-Wert in cm Mikro-Tesla '' ('' µT''). Diese Funktion wird nicht im Simulator unterstützt.",
  "input.onButtonPressed":"Etwas zu tun, wenn eine ('' A'', '' B'' oder beide '' A + B'') gedrückt ist",
  "input.onGesture":"Fügt Code ausgeführt, wenn der Bildschirm nach oben.",
  "input.onLogoDown":"Fügt Code ausgeführt, wenn das Logo orientiert sich nach unten und das Board vertikal ist.",
  "input.onLogoUp":"Fügt Code ausgeführt, wenn das Logo orientiert sich nach oben und das Board vertikal ist.",
  "input.onPinPressed":"Tun Sie etwas, wenn eine Pin ('' P0'', '' P1'' oder beide '' P2'') gedrückt wird.",
  "input.onScreenDown":"Fügt Code ausgeführt, wenn der Bildschirm ist nach unten.",
  "input.onScreenUp":"Fügt Code ausgeführt, wenn der Bildschirm nach oben.",
  "input.onShake":"Fügt Code ausgeführt, wenn das Gerät geschüttelt wird.",
  "input.pinIsPressed":"Holen Sie sich den Pin-Zustand (gepresst oder nicht). Verlangt, die behaupten, die Schaltung zu schließen.",
  "input.rotation":"Die Tonhöhe des Geräts, Rotation entlang der '' x-Achse '' in Grad.",
  "input.runningTime":"Ruft die Anzahl der Millisekunden seit macht auf vergangen.",
  "input.setAccelerometerRange":"Legt den Beschleunigungsmesser Beispiel in Schwerkräfte.",
  "input.temperature":"Ruft die Temperatur in Celsius Grad (° C).",
  "led":"Steuerung von LED-Bildschirm.",
  "led.brightness":"Steigen Sie die Helligkeit des Bildschirms von 0 () bis 255 (volle hell).",
  "led.fadeIn":"Anzeige auf dem Bildschirm eingeblendet wird.",
  "led.fadeOut":"Die Helligkeit des Bildschirms ausgeblendet.",
  "led.plot":"Schalten Sie den angegebenen LED mit x \/ y-Koordinaten (X ist horizontal, y ist vertikal). (0,0) ist oben links.",
  "led.plotAll":"Schaltet alle LEDS",
  "led.plotBarGraph":"Zeigt eine vertikale Balkendiagramm anhand der 'Wert' und 'hoch' Wert.\nWenn 'hoch' ist 0, das Diagramm wird automatisch angepasst.",
  "led.point":"Erhalten Sie den ein-\/Zustand der angegebenen LED mit x \/ y-Koordinaten. (0,0) ist oben links.",
  "led.screenshot":"Nimmt einen Screenshot von dem LED-Bildschirm und gibt ein Bild.",
  "led.setBrightness":"Legen Sie die Helligkeit des Bildschirms von 0 (aus) auf 255 (volle hell).",
  "led.setDisplayMode":"Stellt den Anzeigemodus zwischen schwarz und weiß und Graustufen für das Rendern von LEDs.",
  "led.stopAnimation":"Bricht die aktuelle Animation und löscht andere ausstehende Animationen.",
  "led.toggle":"Schaltet ein bestimmtes Pixels",
  "led.toggleAll":"Kehrt die aktuelle LED-Anzeige",
  "led.unplot":"Schalten Sie den angegebenen LED mit x \/ y-Koordinaten (X ist horizontal, y ist vertikal). (0,0) ist oben links.",
  "music":"Generation der Musiktöne durch Pin '' P0''.",
  "music.beat":"Gibt die Dauer von einem Beat in Millisekunden",
  "music.changeTempoBy":"Das Tempo zu ändern, um den angegebenen Betrag",
  "music.noteFrequency":"Ruft die Frequenz einer Note.",
  "music.playTone":"Spielt einen Ton durch Pin '' P0'' für die angegebene Dauer.",
  "music.rest":"Ruht (spielt nichts) für eine bestimmte Zeit durch Pin '' P0''.",
  "music.ringTone":"Spielt einen Ton durch Pin '' P0''.",
  "music.setTempo":"Legt das Tempo auf den angegebenen Betrag",
  "music.tempo":"Gibt das Tempo in Schlägen pro Minute. Das Tempo ist die Geschwindigkeit (Bpm = Beats pro Minute) welche Noten spielen. Je größer der Tempowert werden desto schnelleren die Noten spielen.",
  "pins":"Steuerströmen Pins für analoge\/digitale Signale, Servos, i2c...",
  "pins.analogPitch":"Eine Puls-Weiten-Modulation (PWM) Signal an der aktuellen Tonhöhe Pin ausgibt. Verwenden Sie 'Analog legen Tonhöhe Pin' die Tonhöhe Pin definieren.",
  "pins.analogReadPin":"Lesen Sie den Connector-Wert als Analog, d. h. als Wert zwischen 0 und 1023.",
  "pins.analogSetPeriod":"Konfiguriert die Pulsweitenmodulation (PWM) über den analogen Ausgang auf den angegebenen Wert in ** Mikrosekunden ** oder \"1\/1000' Millisekunden.\nWenn dieser Pin nicht als ein analoger Ausgang (mit 'analog schreiben Pin') konfiguriert ist, ist die Operation wirkungslos.",
  "pins.analogSetPitchPin":"Legt die Pin mit 'Stifte-> analoge Tonhöhe' verwendet.",
  "pins.analogWritePin":"Legen Sie den Connector-Wert als analoge. Wert muss zwischen 0 und 1023 bestehen.",
  "pins.digitalReadPin":"Lesen Sie die angegebene Pin oder Connector als 0 oder 1",
  "pins.digitalWritePin":"Legen Sie einen Pin oder Connector Wert auf 0 oder 1.",
  "pins.i2cReadNumber":"Lesen Sie eine Zahl von 7-Bit-I2C-Adresse.",
  "pins.i2cWriteNumber":"Schreiben Sie eine Zahl in eine 7-Bit-I2C-Adresse.",
  "pins.map":"Re-Karten eine Zahl aus einem Bereich in einen anderen. D. h. ein Wert '' von Low '' würden '' zu niedrig '', '' von hoher '' der Wert bis cm zu hoch '' Werte dazwischen zu Werte dazwischen, etc. zugeordnet bekommen.",
  "pins.onPulsed":"Dieser Pin mit einem digitalen Eingang konfiguriert, und generiert Ereignisse wo der Zeitstempel die Dauer ist, die dieser Pin entweder '' hoch '' oder '' niedrig '' war.",
  "pins.pulseDuration":"Ruft die Dauer des letzten Impulses in Mikrosekunden. Diese Funktion sollte von einem '' OnPulsed''-Handler aufgerufen werden.",
  "pins.servoSetPulse":"Konfiguriert dieser IO-Pin als Ausgang Analog\/Pwm, konfiguriert den Zeitraum um 20 ms zu sein und legt die Pulslänge, basierend auf dem Wert ist es gegeben ** Mikrosekunden ** oder \"1\/1000' Millisekunden.",
  "pins.servoWritePin":"Schreibt einen Wert in das Servo Steuerung der Welle entsprechend. Auf einem standard-Servo wird dies den Winkel der Welle (in Grad), Umzug der Welle in dieser Ausrichtung festgelegt. Auf eine kontinuierliche Rotation-Servo wird dies die Geschwindigkeit der Servo (mit '' 0'' wird Höchstgeschwindigkeit in der einen Richtung cm 180 cm voll zu beschleunigen, in die andere und einen Wert in der Nähe von '' 90 cm wird keine Bewegung) festgelegt.",
  "pins.setPull":"Die Anziehungskraft dieser Pin konfiguriert.",
  "serial":"Lesen und Schreiben von Daten über eine serielle Verbindung.",
  "serial.readLine":"Liest eine Textzeile aus der seriellen Schnittstelle.",
  "serial.redirect":"Dynamisch konfigurieren die serielle Instanz um Pins als USBTX und USBRX verwenden.",
  "serial.writeLine":"Druckt eine Textzeile an die serielle",
  "serial.writeNumber":"Druckt einen numerischen Wert an die serielle",
  "serial.writeString":"Sendet ein Stück Text über serielle Verbindung.",
  "serial.writeValue":"Schreibt ein '' Name: Wert '' Zeile an die serielle Paar."
}