{
  "Math.randomBoolean":"Génère une valeur « true » ou « false » au hasard, tout comme le retournement d’une pièce de monnaie.",
  "String.fromCharCode":"Faire une chaîne de la donnée code de caractères ASCII.",
  "basic":"Permet d'accéder aux fonctionnalités de base micro : bit.",
  "basic.clearScreen":"Désactiver toutes les LEDs",
  "basic.forever":"Répète le code pour toujours en arrière-plan. À chaque itération, permet aux autres codes d'exécuter.",
  "basic.pause":"Pause pendant la durée spécifiée en millisecondes",
  "basic.plotLeds":"Dessine une image sur l'écran LED.",
  "basic.showAnimation":"Montre une séquence d'écrans LED comme une animation.",
  "basic.showLeds":"Dessine une image sur l'écran LED.",
  "basic.showNumber":"Mettez en surbrillance un numéro sur l'écran. Si le numéro s'inscrit sur l'écran (c'est-à-dire un seul chiffre), ne défilent pas.",
  "basic.showString":"Afficher du texte à l'écran, un caractère à la fois. Si la chaîne s'inscrit sur l'écran (c'est-à-dire une lettre), ne défile pas.",
  "control":"Utilitaires d'exécution et événements.",
  "control.inBackground":"Horaires du code qui s'exécutent en arrière-plan.",
  "control.reset":"Réinitialise le BBC micro : bit.",
  "game":"Un moteur de jeu unique-LED sprite",
  "game.addScore":"Ajoute des points pour le score actuel",
  "game.gameOver":"Affiche un jeu au dessus de l'animation.",
  "game.score":"Obtient le score actuel",
  "game.setScore":"Définit la valeur actuelle de la partition",
  "game.startCountdown":"Commence un compte à rebours jeu",
  "images":"Création, manipulation et affichage d'images LED.",
  "images.createBigImage":"Crée une image avec 2 images.",
  "images.createImage":"Crée une image qui s'adapte à l'écran LED.",
  "input":"Événements et des données provenant de capteurs",
  "input.acceleration":"Obtenir la valeur de l'accélération en milli-gravitys (lorsque le jury pose plat avec l'écran vers le haut, x = 0, y = 0 et z =-1024)",
  "input.buttonIsPressed":"Obtenir l'état du bouton (pressé ou non) pour '' A'' et '' B''.",
  "input.calibrate":"Obsolète, boussole de calibrage est automatique.",
  "input.compassHeading":"Obtenir le cap compas boussole actuel en degrés.",
  "input.lightLevel":"Lit le niveau de lumière appliqué à l'écran LED dans une gamme de '' 0'' (noir) à 255 '''' lumineux.",
  "input.magneticForce":"Obtenir la valeur de la force magnétique dans '' micro-Teslas'' ('' µT''). Cette fonction n'est pas pris en charge dans le simulateur.",
  "input.onButtonPressed":"Faire quelque chose quand vous appuyez sur un bouton ('' A'', '' B'' ou les deux '' A + B'')",
  "input.onGesture":"Attache le code à exécuter lorsque l'écran vers le haut.",
  "input.onLogoDown":"Attache le code à exécuter lorsque le logo est orienté vers le bas et le jury est vertical.",
  "input.onLogoUp":"Attache le code à exécuter lorsque le logo est orienté vers le haut et le jury est vertical.",
  "input.onPinPressed":"Faire quelque chose lorsque vous appuyez sur une broche ('' P0'', '' P1'' ou les deux '' P2'').",
  "input.onScreenDown":"Attache le code à exécuter lorsque l'écran vers le bas.",
  "input.onScreenUp":"Attache le code à exécuter lorsque l'écran vers le haut.",
  "input.onShake":"Attache le code à exécuter lorsque l'appareil est secoué.",
  "input.pinIsPressed":"Obtenir l'état de la broche (pressé ou non). Nécessite de tenir au sol pour fermer le circuit.",
  "input.rotation":"La hauteur de l'appareil, rotation sur axe le '' x '', en degrés.",
  "input.runningTime":"Obtient le nombre de millisecondes écoulées depuis le pouvoir sur.",
  "input.setAccelerometerRange":"Définit la plage d'échantillon accéléromètre de gravités.",
  "input.temperature":"Obtient la température en Celsius degrés (° C).",
  "led":"Contrôle de l'écran LED.",
  "led.brightness":"Descendre la luminosité de l'écran de 0 () à 255 (pleine intensité).",
  "led.fadeIn":"Fondu dans l'affichage à l'écran.",
  "led.fadeOut":"S'évanouit la luminosité de l'écran.",
  "led.plot":"Allumer la LED spécifiée par x, y coordonnées (x est horizontal, y est verticale). (0,0) est en haut à gauche.",
  "led.plotAll":"Tous les voyants s'allume",
  "led.plotBarGraph":"Affiche un graphique à barres vertical basé sur la « valeur » et la valeur « élevée ».\nSi « élevé » est 0, le tableau s'ajuste automatiquement.",
  "led.point":"Obtenir l'État marche\/arrêt de la LED spécifiée par x, y coordonnées. (0,0) est en haut à gauche.",
  "led.screenshot":"Prend une capture d'écran de l'écran LED et renvoie une image.",
  "led.setBrightness":"Régler la luminosité de l'écran de 0 (off) à 255 (pleine intensité).",
  "led.setDisplayMode":"Définit le mode d'affichage entre noir et blanc et gris pour le rendu des LEDs.",
  "led.stopAnimation":"Annule l'animation actuelle et efface les autres en attente d'animations.",
  "led.toggle":"Active\/désactive un pixel particulier",
  "led.toggleAll":"Inverse l'affichage actuel",
  "led.unplot":"Éteindre la LED spécifiée par x, y coordonnées (x est horizontal, y est verticale). (0,0) est en haut à gauche.",
  "music":"Génération de sonneries musicales via broche '' P0''.",
  "music.beat":"Retourne la durée d'un battement en milli-secondes",
  "music.changeTempoBy":"Changer le tempo de la quantité spécifiée",
  "music.noteFrequency":"Obtient la fréquence d'une note.",
  "music.playTone":"Joue une tonalité via broche '' P0'' pour la durée donnée.",
  "music.rest":"Repose (joue rien) pendant une durée spécifiée via broche '' P0''.",
  "music.ringTone":"Joue une tonalité via broche '' P0''.",
  "music.setTempo":"Définit le tempo à la quantité spécifiée",
  "music.tempo":"Retourne le tempo en battements par minute. Tempo est la vitesse (bpm = battements par minute) à qui jouent des notes. Plus la valeur du tempo, plus vite les notes jouera.",
  "pins":"Contrôle des courants à Pins pour signaux analogiques\/numériques, servos, i2c...",
  "pins.analogPitch":"Émet un signal de modulation (PWM) de largeur d'impulsion à l'axe de tangage actuelle. Utilisez « analog set axe de tangage » pour définir l'axe de tangage.",
  "pins.analogReadPin":"Lire la valeur de connecteur analogique, c'est-à-dire comme une valeur comprise entre 0 et 1023.",
  "pins.analogSetPeriod":"Configure la modulation de largeur d'impulsion (PWM) de la sortie à la valeur donnée en analogique ** microsecondes ** ou « 1\/1000' millisecondes.\nSi cette broche n'est pas configurée comme un analogue de sortie (en utilisant « écriture analogique pin »), l'opération n'a aucun effet.",
  "pins.analogSetPitchPin":"Définit l'axe utilisé lors de l'utilisation de \"pins-> pitch analogique\".",
  "pins.analogWritePin":"Définissez la valeur de connecteur analogique. Valeur doit être comprise entre 0 et 1023.",
  "pins.digitalReadPin":"Lire la broche spécifié ou le connecteur comme 0 ou 1",
  "pins.digitalWritePin":"Définir une valeur de code pin ou le connecteur à 0 ou 1.",
  "pins.i2cReadNumber":"Lire un numéro de 7-bit I2C adresse.",
  "pins.i2cWriteNumber":"Écrire un nombre à une adresse I2C de 7 bits.",
  "pins.map":"Remappe un nombre d'une plage à l'autre. Autrement dit, une valeur '' de faible '' serait sont mappée aux '' à faible '', une valeur de '' de haut '' à '' à haute '', valeurs intermédiaires à etc in-between, de valeurs.",
  "pins.onPulsed":"Configure cette broche pour une entrée numérique et génère des événements où l’horodatage est la durée pendant laquelle cette broche a été '' élevé '' ou '' faible ''.",
  "pins.pulseDuration":"Obtient la durée de la dernière impulsion en microsecondes. Cette fonction doit être appelée à partir d’un gestionnaire de '' onPulsed''.",
  "pins.servoSetPulse":"Configure cette broche e\/s comme une sortie analogique\/pwm, configure le laps de temps pour être 20 ms et définit la largeur d'impulsion, basée sur la valeur, il est donné ** microsecondes ** ou « 1\/1000' millisecondes.",
  "pins.servoWritePin":"Écrit une valeur à l'asservissement, contrôle de l'arbre en conséquence. Sur un servo standard, cette fonction définira l'angle de l'arbre (en degrés), déplacer l'arbre à cette orientation. Sur un servo de rotation continue, cette fonction définira la vitesse du servo (avec '' 0'' en pleine vitesse dans une seule direction, '' 180 cm en pleine vitesse dans l'autre et une valeur de près de 90 '''' aucun mouvement).",
  "pins.setPull":"Configure l’attraction de cette broche.",
  "serial":"Lire et écrire des données sur une connexion série.",
  "serial.readLine":"Lit une ligne de texte à partir du port série.",
  "serial.redirect":"Configuration dynamique de l’instance de série pour utiliser des épingles autres que USBTX et USBRX.",
  "serial.writeLine":"Imprime une ligne de texte pour le numéro de série",
  "serial.writeNumber":"Imprime une valeur numérique de la série",
  "serial.writeString":"Envoie un morceau de texte via la connexion série.",
  "serial.writeValue":"Écrit un « nom : valeur '' paire de ligne de la série."
}